// 1. За допомогою методів об’єкта window створити:
// 	1) нове вікно розміром 300х300 пікселів.
// 	2) із затримкою 2 сек змініть розміри вікна на 500х500 пікселів
// 	3) із затримкою 2 сек перемістіть вікно в точку з координатами (200, 200)
// 	4) із затримкою 2 сек закрийте вікно.

function task01() {
    const newWindow = window.open('', 'Window300', 'width=300,height=300');

    setTimeout(() => {
        newWindow.resizeTo(500, 500);
        setTimeout(() => {
            newWindow.moveTo(200, 200);
            setTimeout(() => {
                newWindow.close();
            }, 2000);
        }, 2000);
    }, 2000);
}


// 2. Для заданої HTML-сторінки:

// <p id ='text'>I learning JavaScript events!</p>
// <div>
// 	<button . . . . . >Change style!</button>
// </div>

// напишіть функцію changeCSS(),
// яка спрацьовуватиме по кліку на кнопку
// і змінюватиме стиль вмісту тега <p>:
//      колір шрифту – оранжевий,
//      розмір шрифту 20 пс,
//      шрифт сімейства "Comic Sans MS".

function changeCSS() {
    const p = document.getElementById("text");
    p.style = "color: orange; font-size: 20px; font-family: Comic Sans MS;";
}


// 3. Задано сторінку з 3 кнопками і 1 лінкою. Напишіть Javascript код і реалізуйте HTML-сторінку з відповідними подіями на кожному елементові:
// 	1) 1-ша кнопка – при кліку на неї колір фону сторінки міняється на синій
// 	2) 2-га кнопка – при подвійному кліку на неї колір фону сторінки міняється на рожевий
// 	3) 3-я кнопка – при натисненні і утримуванні кнопки колір фону сторінки стає коричневий. При відпусканні – білий.
// 	4) При наведенні на лінку – колір фону стає жовтим, при відведенні – білим.
// 	Приклад – курсор наведений на лінку.

// 4. Реалізуйте програму, яка по натисканню на кнопку видалятиме обраний елемент випадаючого списку. Можуть видалятися всі елементи в будь-якому порядку.

// 5. Реалізуйте програму, яка по натисканню на кнопку виводитиме повідомлення
// "I was pressed!", при наведенні на кнопку виводитиме повідомлення "Mouse on me!", а при відведенні курсора миші виводитиме повідомлення "Mouse is not on me!".

// Приклад роботи:

// 6. Реалізуйте програму, яка відслідковуватиме зміну розміру (ширини і висоти) вікна браузера і виводитиме на поточну сторінку при її розтязі/стисканні відповідні значення.

// 7*. На сторінці потрібно реалізувати 2 випадаючих списки. У першому містяться назви країн, у другому – назви міст. Реалізувати роботу таким чином, щоб коли вибирається з лівого випадаючого списку певна країна - в правому випадаючому  списку з'являлися міста цієї країни. Список міст формується динамічно, через JavaScript. Також потрібно нижче вивести назву обраної країни і місто.

// Код HTML-сторінки:
// <select name="country" id="country">
// 	<option value="ger">Germany</option>
// 	<option value="usa">USA</option>
// 	<option value="ukr">Ukraine</option>
// </select>

// <select name="cities" id="cities"></select>
// <p></p>
